In [1]:
import pandas as pd
people={"first":["Rajat","corey","John",None,"Missing","Na"],
        "last":["Gupta","sch","doe","na","Jarvis","norman"],
        "email":["RajatGupta@email.com","corey@email.com","john@email.com","Missing",None,"na"]}

In [2]:
df=pd.DataFrame(people)

In [3]:
df

     first    last                 email
0    Rajat   Gupta  RajatGupta@email.com
1    corey     sch       corey@email.com
2     John     doe        john@email.com
3     None      na               Missing
4  Missing  Jarvis                  None
5       Na  norman                    na

In [4]:
df.to_csv("first_a.csv",index=False)

In [5]:
df=pd.read_csv("first_a.csv")

In [6]:
df

     first    last                 email
0    Rajat   Gupta  RajatGupta@email.com
1    corey     sch       corey@email.com
2     John     doe        john@email.com
3      NaN      na               Missing
4  Missing  Jarvis                   NaN
5       Na  norman                    na

In [7]:
df=pd.read_csv("first_a.csv",header=1,names=["first","last","email"],na_values={"first":"Missing"})

In [8]:
df

   first    last            email
0  corey     sch  corey@email.com
1   John     doe   john@email.com
2    NaN      na          Missing
3    NaN  Jarvis              NaN
4     Na  norman               na

In [9]:
df=pd.read_csv("first_a.csv",header=1,na_values={"first":"Missing"})

In [10]:
df

     Rajat   Gupta RajatGupta@email.com
0    corey     sch      corey@email.com
1     John     doe       john@email.com
2      NaN      na              Missing
3  Missing  Jarvis                  NaN
4       Na  norman                   na

In [11]:
df=pd.read_csv("first_a.csv",skiprows=2)

In [12]:
df

     corey     sch corey@email.com
0     John     doe  john@email.com
1      NaN      na         Missing
2  Missing  Jarvis             NaN
3       Na  norman              na

In [13]:
df=pd.read_csv("first_a.csv",skiprows=2,header=3)

In [14]:
df

  Missing  Jarvis Unnamed: 2
0      Na  norman         na

In [15]:
df=pd.read_csv("first_a.csv",header=3,skiprows=1)

In [16]:
df

  Unnamed: 0      na Missing
0    Missing  Jarvis     NaN
1         Na  norman      na

In [17]:
df=pd.read_csv("first_a.csv",nrows=2)

In [18]:
df

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com

In [19]:
df=pd.read_csv("first_a.csv",header=None,names=["first","last","email"])

In [20]:
df

     first    last                 email
0    first    last                 email
1    Rajat   Gupta  RajatGupta@email.com
2    corey     sch       corey@email.com
3     John     doe        john@email.com
4      NaN      na               Missing
5  Missing  Jarvis                   NaN
6       Na  norman                    na

In [21]:
df=pd.read_csv("first_a.csv",header=None,names=["first","last","email"],skiprows=1)

In [22]:
df

     first    last                 email
0    Rajat   Gupta  RajatGupta@email.com
1    corey     sch       corey@email.com
2     John     doe        john@email.com
3      NaN      na               Missing
4  Missing  Jarvis                   NaN
5       Na  norman                    na

In [23]:
df=pd.read_csv("first_a.csv",header=None,names=["first","last","email"],nrows=2)

In [24]:
df

   first   last                 email
0  first   last                 email
1  Rajat  Gupta  RajatGupta@email.com

In [25]:
df=pd.read_csv("first_a.csv",header=None,names=["first","last","email"],na_values={"first":["Missing"],"last":["na","norman"],"email":["na","Missing"]})

In [26]:
df

   first    last                 email
0  first    last                 email
1  Rajat   Gupta  RajatGupta@email.com
2  corey     sch       corey@email.com
3   John     doe        john@email.com
4    NaN     NaN                   NaN
5    NaN  Jarvis                   NaN
6     Na     NaN                   NaN

In [27]:
df=pd.read_csv("first_a.csv",index_col="first")

In [28]:
df

           last                 email
first
Rajat     Gupta  RajatGupta@email.com
corey       sch       corey@email.com
John        doe        john@email.com
NaN          na               Missing
Missing  Jarvis                   NaN
Na       norman                    na

In [29]:
df=pd.read_csv("first_a.csv",na_values={"first":["Missing"],"last":["na","norman"],"email":["na","Missing"]})

In [30]:
df

   first    last                 email
0  Rajat   Gupta  RajatGupta@email.com
1  corey     sch       corey@email.com
2   John     doe        john@email.com
3    NaN     NaN                   NaN
4    NaN  Jarvis                   NaN
5     Na     NaN                   NaN

In [31]:
df.to_csv("second_a.csv",index=False,sep="\t")

In [32]:
pd.read_csv("second_a.csv")

                   first\tlast\temail
0  Rajat\tGupta\tRajatGupta@email.com
1         corey\tsch\tcorey@email.com
2           John\tdoe\tjohn@email.com
3                          \tJarvis\t
4                              Na\t\t

In [33]:
pd.read_csv("second_a.csv",sep="\t")

   first    last                 email
0  Rajat   Gupta  RajatGupta@email.com
1  corey     sch       corey@email.com
2   John     doe        john@email.com
3    NaN     NaN                   NaN
4    NaN  Jarvis                   NaN
5     Na     NaN                   NaN

In [34]:
df.to_csv("third_a.csv")

In [35]:
pd.read_csv("third_a.csv")

   Unnamed: 0  first    last                 email
0           0  Rajat   Gupta  RajatGupta@email.com
1           1  corey     sch       corey@email.com
2           2   John     doe        john@email.com
3           3    NaN     NaN                   NaN
4           4    NaN  Jarvis                   NaN
5           5     Na     NaN                   NaN

In [36]:
df.to_csv("fourth_a.csv",index=False)

In [37]:
pd.read_csv("fourth_a.csv")

   first    last                 email
0  Rajat   Gupta  RajatGupta@email.com
1  corey     sch       corey@email.com
2   John     doe        john@email.com
3    NaN     NaN                   NaN
4    NaN  Jarvis                   NaN
5     Na     NaN                   NaN

In [38]:
df.to_csv("fifth_a.csv",index=False,columns=["first","last"])

In [39]:
pd.read_csv("fifth_a.csv")

   first    last
0  Rajat   Gupta
1  corey     sch
2   John     doe
3    NaN     NaN
4    NaN  Jarvis
5     Na     NaN

In [40]:
df.to_csv("sixth_a.csv",index=False,header=False)

In [41]:
pd.read_csv("sixth_a.csv")

   Rajat   Gupta RajatGupta@email.com
0  corey     sch      corey@email.com
1   John     doe       john@email.com
2    NaN     NaN                  NaN
3    NaN  Jarvis                  NaN
4     Na     NaN                  NaN